
# Dialog
dialog.ckan.overwrite      = Prep\u00EDsa\u0165 existuj\u00FAce zdroje
dialog.ckan.resource.name  = N\u00E1zov zdroja v CKANe
dialog.errors.params       = Ch\u00FDbaj\u00FA povinn\u00E9 konfigura\u010Dn\u00E9 parametre
dialog.resource.name.help  = Tento n\u00E1zov by sa nemal meni\u0165 medzi jednotliv\u00FDmi behmi procesu. N\u00E1zov zdroja je pou\u017Eit\u00FD ako k\u013E\u00FA\u010D do CKANu. Ak sa n\u00E1zov zmen\u00ED, zdroj v CKANe nebude aktualizovan\u00FD a bude vytvoren\u00FD v\u017Edy nov\u00FD
dialog.resource.name.input = Vlo\u017Ete n\u00E1zov zdroja v CKANe

# Messages
dpu.ckan.starting                = {0} \u0161tartuje.
dpu.datastore.delete.failed      = Nepodarilo sa vymaza\u0165 CKAN datastore
dpu.datastore.delete.failed.long = Toto nemus\u00ED by\u0165 chyba, m\u00F4\u017Ee to znamen\u0165 len to, \u017Ee d\u00E1tov\u00FD zdroj u\u017E existuje, ale datastore neexistuje aj ke\u010F sa to o\u010Dak\u00E1va. M\u00F4\u017Ee to by\u0165 v\u00FDsledok predch\u00E1dzaj\u00FAcej ne\u00FAspe\u0161nej exek\u00FAcie alebo manu\u00E1lneho z\u00E1sahu do datastore
dpu.name                         = Ulo\u017Eenie tabu\u013Eky do katal\u00F3gu
dpu.name.menu                    = tabu\u013Eka do katal\u00F3gu
dpu.resource.created             = Zdroj a datastore {0} boli vytvoren\u00E9
dpu.resource.dataseterror        = Nepodarilo sa z\u00EDska\u0165 Dataset z CKAN. Odpove\u010F: {0}
dpu.resource.responseerror       = CKAN odpovedal, \u017Ee oper\u00E1cia bola ne\u00FAspe\u0161n\u00E1. Pre podrobnosti prezrite logy
dpu.resource.skipped.long        = Zdroj bol vynechan\u00FD, preto\u017Ee u\u017E existuje v katal\u00F3gu a prepisovac\u00ED m\u00F3d nie je zapnut\u00FD
dpu.resource.skipped.short       = Vytv\u00E1ranie zdroja {0} vynechan\u00E9
dpu.resource.updated             = Zdroj a datastore {0} boli aktualizovan\u00E9 
dpu.resource.upload              = Nepodarilo sa vytvori\u0165 zdroj a datastore {0} pre datab\u00E1zov\u00FA tabu\u013Eku {1}

errors.api.missing     = Ch\u00FDba glob\u00E1lna (preferovan\u00E1) aj proces \u0161pecifick\u00E1 konfigura\u010Dn\u00E1 hodnota pre umiestnenie CKAN API
errors.dpu.dataset     = Nepodarilo sa z\u00EDska\u0165 zoznam existuj\u00FAcich zdrojov pre tento proces
# Errors
errors.dpu.failed      = Vykon\u00E1vanie kroku zlyhalo
errors.dpu.upload      = Nastala intern\u00E1 chyba pri vytv\u00E1ran\u00ED katal\u00F3gov\u00FDch zdrojov zo vstupn\u00FDch tabuliek   
errors.input.tables    = Nespr\u00E1vny po\u010Det tabuliek na vstupe kroku. Krok m\u00F4\u017Ee spracova\u0165 len jednu tabu\u013Eku
errors.tables.iterator = Nepodarilo sa na\u010D\u00EDta\u0165 vstupn\u00E9 datab\u00E1zov\u00E9 tabu\u013Eky
errors.token.missing   = Ch\u00FDba glob\u00E1lna (preferovan\u00E1) aj proces \u0161pecifick\u00E1 konfigura\u010Dn\u00E1 hodnota pre CKAN autentifika\u010Dn\u00FD znak
